MAIN_COLOR = 0xa8e1fa
RED_COLOR = 0xfa5252
ORANGE_COLOR = 0xffc157
PINK_COLOR = 0xe0b3c7
PINK_COLOR_2 = 0xFFC0CB


Prefix = "C", "c", ">"
Owner_id = "806346991730819121"
好喔_pic = "https//cdn.discordapp.com/attachments/834074590720294912/854959330671591435/unknown.png"
WEBHOOK_URL = "https//discord.com/api/webhooks/859633422498398288/5JVnexiCnP3BIk-kLPuAk4xDqadplNzgv-85zyS25poVDjhFjPwXz1CX0SDkbUlkcSwb"
leaderboard_image = "https://cdn.discordapp.com/attachments/812895798496591882/825363205853151252/ML_1.png"

xp_per_level = 100
leaderboard_amount = 10



添加身分組 = {
    858140566268411924 :{
        'Emoji':'837971561725952020',
        'Emoji':'🌻',
        'Emoji':'🆙',
        'Emoji':'🍔',
        'Emoji':'861185706336845834',
        '837971561725952020(Message_Add)':'您已獲得進入紅燈區之通行證。',
        '🌻(Message_Add)':'您已獲得進入墓園之通行證。',
        '🆙(Message_Add)':'您已獲得進入練等專區之通行證。',
        '🍔(Message_Add)':'您已獲得進入晚餐揪揪群之通行證。',
        '861185706336845834(Message_Add)':'您已獲得進入CC-OSV待辦事項區之通行證。',
        '837971561725952020(Message_Delete)':'您已被禁止進入紅燈區。',
        '🌻(Message_Delete)':'您已被禁止進入墓園。',
        '🆙(Message_Delete)':'您已被禁止進入練等專區。',
        '🍔(Message_Delete)':'您已被禁止進入晚餐揪揪群。',
        '861185706336845834(Message_Delete)':'您已被禁止進入CC-OSV待辦事項區',        
        '837971561725952020(role)':'837975201915994153',
        '🌻(role)':'863628692802240522',
        '🆙(role)':'863629520719839242',
        '🍔(role)':'837975201915994153',
        '861185706336845834(role)':'863639159461773322',        
    },
    858138565967085649 :{
        'Emoji':'1840492057009324073',
        'Emoji':'858138565967085649',
        '837971561725952020(Message_Add)':'您已獲大同國民黨黨籍。',
        '1840492057009324073(Message_Add)':'您已獲星曌黨黨籍。',
        '837971561725952020(Message_Delete)':'您已退黨。',
        '1840492057009324073(Message_Delete)':'您已退黨。',
        '1840492057009324073(role)':'837968327014875177',
        '858138565967085649(role)':'860396953551634432',     
    },
    847029838546993163 :{
        'Emoji':'2847026711064346655',
        'Emoji':'1847026710780051477',
        '1847026710780051477(Message_Add)':'您已成功變更名稱顏色。',
        '2847026711064346655(Message_Add)':'您已成功變更名稱顏色。',
        '837971561725952020(Message_Delete)':'您已成功移除名稱顏色。',
        '1847026710780051477(Message_Delete)':'您已成功移除名稱顏色。',
        '837971561725952020(role)':'846317257990733855',
        '1847026710780051477(role)':'846317182577278998',     
    },
    847031310358544394 :{
        'Emoji':'1847026710780051477',
        'Emoji':'2847026711064346655',
        '1847026710780051477(Message_Add)':'您已成功變更名稱顏色。',
        '2847026711064346655(Message_Add)':'您已成功變更名稱顏色。',
        '1847026710780051477(Message_Delete)':'您已成功移除名稱顏色。',
        '2847026711064346655(Message_Delete)':'您已成功移除名稱顏色。',
        '1847026710780051477(role)':'846317273244762142',
        '2847026711064346655(role)':'860396953551634432',
    },
    847031700969095188 :{
        'Emoji':'1847026710780051477',
        'Emoji':'2847026711064346655',
        '1847026710780051477(Message_Add)':'您已成功變更名稱顏色。',
        '2847026711064346655(Message_Add)':'您已成功變更名稱顏色。',
        '1847026710780051477(Message_Delete)':'您已成功移除名稱顏色。',
        '2847026711064346655(Message_Delete)':'您已成功移除名稱顏色。',
        '1847026710780051477(role)':'846317390551842846',
        '2847026711064346655(role)':'846317401469485116',     
    },
    847033542990626816 :{
        'Emoji':'1847026710780051477',
        'Emoji':'2847026711064346655',
        'Emoji':'3847026710850568243',
        'Emoji':'4847026711106420776',
        'Emoji':'1847026710780051477',         
        '1847026710780051477(Message_Add)':'您已成功變更名稱顏色。',
        '2847026711064346655(Message_Add)':'您已成功變更名稱顏色。',
        '3847026710850568243(Message_Add)':'您已成功變更名稱顏色。',
        '4847026711106420776(Message_Add)':'您已成功變更名稱顏色。',
        '1847026710780051477(Message_Add)':'您已成功變更名稱顏色。',                
        '1847026710780051477(Message_Delete)':'您已成功移除名稱顏色。',
        '2847026711064346655(Message_Delete)':'您已成功移除名稱顏色。',
        '3847026710850568243(Message_Delete)':'您已成功移除名稱顏色。',
        '4847026711106420776(Message_Delete)':'您已成功移除名稱顏色。',
        '1847026710780051477(Message_Delete)':'您已成功移除名稱顏色。',                
        '1847026710780051477(role)':'846317443924361246',
        '2847026711064346655(role)':'846317486235582485',
        '3847026710850568243(role)':'846317533912891403',
        '4847026711106420776(role)':'846317418540302416',     
        '5847026710842179585(role)':'846317429466595348',                
    },
    858139579172651028 :{
        'Emoji':'840493545034481684',
        'Emoji':'845572996089249792',
        '840493545034481684(Message_Add)':'您已成功入教。願蘿神保佑您。',
        '845572996089249792(Message_Add)':'您已退教。',
        '840493545034481684(Message_Delete)':'您已入哲♂學會。',
        '845572996089249792(Message_Delete)':'您已退會。',
        '840493545034481684(role)':'858139056843915264',
        '845572996089249792(role)':'834430171171258417',  
    },    
     858160262606880818 :{
        'Emoji':'858154997640331274',
        '858154997640331274(role)':'834430171171258417',
        '858154997640331274(Message_Add)':'您已成功進入我國國境。',
        '858154997640331274(Message_Delete)':'好喔',
    }                                                                                    
}
