MAIN_COLOR = 0xa8e1fa
RED_COLOR = 0xfa5252
ORANGE_COLOR = 0xffc157
PINK_COLOR = 0xe0b3c7
PINK_COLOR_2 = 0xFFC0CB

Prefix = "C","c"
Owner_id = "806346991730819121"
好喔_pic = "https//cdn.discordapp.com/attachments/834074590720294912/854959330671591435/unknown.png"
WEBHOOK_URL = "https//discord.com/api/webhooks/859633422498398288/5JVnexiCnP3BIk-kLPuAk4xDqadplNzgv-85zyS25poVDjhFjPwXz1CX0SDkbUlkcSwb"

添加身分組 = {
    858140566268411924 :{
        '表情符號(加入)':837971561725952020,
        '表情符號(刪除)':837971561725952020,
        'Role':837975201915994153,
        '訊息(加入)':'你已獲得進入紅燈區之通行證。',
        '訊息(刪除)':'你已被禁止進入紅燈區。'
    },
    858140566268411924 :{
        '表情符號(加入)':'🌻',
        '表情符號(刪除)':'🌻',
        'Role':863628692802240522,
        '訊息(加入':'你已獲得進入墓園之通行證。',
        '訊息(刪除)':'你已被禁止進入墓園。'
    },
    858140566268411924 :{
        '表情符號(加入)':'🆙',
        '表情符號(刪除)':'🆙',
        'Role':863629520719839242,
        '訊息(加入':'你已獲得進入練等專區之通行證。',
        '訊息(刪除)':'你已被禁止進入練等專區。'
    },
    858140566268411924 :{
        '表情符號(加入)':'🍔',
        '表情符號(刪除)':'🍔',
        'Role':837975201915994153,
        '訊息(加入':'你已獲得進入晚餐揪揪群之通行證。',
        '訊息(刪除)':'你已被禁止進入晚餐揪揪群。'
    },
    858140566268411924 :{
        '表情符號(加入)':861185706336845834,
        '表情符號(刪除)':861185706336845834,
        'Role':863639159461773322,
        '訊息(加入':'你已獲得進入CC-OSV待辦事項區之通行證。',
        '訊息(刪除)':'你已被禁止進入CC-OSV待辦事項區'
    },
    858138565967085649: {
        '表情符號(加入)':1840492057009324073,
        '表情符號(刪除)':1840492057009324073,
        'Role':837968327014875177,
        '訊息(加入':'你已獲大同國民黨黨籍。',
        '訊息(刪除)':'你已退黨。'
    },
    858138565967085649 :{
        '表情符號(加入)':858138565967085649,
        '表情符號(刪除)':858138565967085649,
        'Role':860396953551634432,
        '訊息(加入':'你已獲星曌黨黨籍。',
        '訊息(刪除)':'你已退黨。'
    },        
     847029838546993163: {
        '表情符號(加入)':2847026711064346655,
        '表情符號(刪除)':2847026711064346655,
        'Role':846317257990733855,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                   
     847029838546993163: {
        '表情符號(加入)':1847026710780051477,
        '表情符號(刪除)':1847026710780051477,
        'Role':846317182577278998,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },        
     847031310358544394: {
        '表情符號(加入)':1847026710780051477,
        '表情符號(刪除)':1847026710780051477,
        'Role':846317273244762142,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },        
     847031310358544394: {
        '表情符號(加入)':2847026711064346655,
        '表情符號(刪除)':2847026711064346655,
        'Role':860396953551634432,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },        
     847031700969095188: {
        '表情符號(加入)':1847026710780051477,
        '表情符號(刪除)':1847026710780051477,
        'Role':846317390551842846,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },        
     847031700969095188: {
        '表情符號(加入)':2847026711064346655,
        '表情符號(刪除)':2847026711064346655,
        'Role':846317401469485116,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },        
     847033542990626816: {
        '表情符號(加入)':1847026710780051477,
        '表情符號(刪除)':1847026710780051477,
        'Role':846317443924361246,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                     
     847033542990626816: {
        '表情符號(加入)':2847026711064346655,
        '表情符號(刪除)':2847026711064346655,
        'Role':846317486235582485,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                     
     847033542990626816: {
        '表情符號(加入)':3847026710850568243,
        '表情符號(刪除)':3847026710850568243,
        'Role':846317533912891403,
        '訊息(加入)':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                     
     847033542990626816: {
        '表情符號(加入)':4847026711106420776,
        '表情符號(刪除)':4847026711106420776,
        'Role':846317418540302416,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                     
     847033542990626816: {
        '表情符號(加入)':5847026710842179585,
        '表情符號(刪除)':5847026710842179585,
        'Role':846317429466595348,
        '訊息(加入':'你已成功變更名稱顏色。',
        '訊息(刪除)':'你已成功移除名稱顏色。'
    },                       
     858139579172651028 :{
        '表情符號(加入)':840493545034481684,
        '表情符號(刪除)':840493545034481684,
        'Role':853484122924515350,
        '訊息(加入':'你已成功入教。願蘿神保佑你。',
        '訊息(刪除)':'你已退教。'
    },       
     858139579172651028 :{
        '表情符號(加入)':845572996089249792,
        '表情符號(刪除)':845572996089249792,
        'Role':858139056843915264,
        '訊息(加入':'你已入哲♂學會。',
        '訊息(刪除)':'你已退會。'
    },      
     858160262606880818 :{
        '表情符號(加入)':858154997640331274,
        '表情符號(刪除)':858154997640331274,
        'Role':834430171171258417,
        '訊息(加入':'你已成功進入我國國境。',
        '訊息(刪除)':'好喔'
    }                                                                                    
}